espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x1_cc26x1/inc/hw_aux_evctl.h
/******************************************************************************
*  Filename:       hw_aux_evctl_h
*  Revised:        $Date$
*  Revision:       $Revision$
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_AUX_EVCTL_H__
#define __HW_AUX_EVCTL_H__

//*****************************************************************************
//
// This section defines the register offsets of
// AUX_EVCTL component
//
//*****************************************************************************
// Event Status 0
#define AUX_EVCTL_O_EVSTAT0                                         0x00000000

// Event Status 1
#define AUX_EVCTL_O_EVSTAT1                                         0x00000004

// Event Status 2
#define AUX_EVCTL_O_EVSTAT2                                         0x00000008

// Event Status 3
#define AUX_EVCTL_O_EVSTAT3                                         0x0000000C

// Direct Memory Access Control
#define AUX_EVCTL_O_DMACTL                                          0x00000018

// Software Event Set
#define AUX_EVCTL_O_SWEVSET                                         0x00000020

// Events To AON Flags
#define AUX_EVCTL_O_EVTOAONFLAGS                                    0x00000024

// Events To AON Polarity
#define AUX_EVCTL_O_EVTOAONPOL                                      0x00000028

// Events To AON Clear
#define AUX_EVCTL_O_EVTOAONFLAGSCLR                                 0x0000002C

// Events to MCU Flags
#define AUX_EVCTL_O_EVTOMCUFLAGS                                    0x00000030

// Event To MCU Polarity
#define AUX_EVCTL_O_EVTOMCUPOL                                      0x00000034

// Events To MCU Flags Clear
#define AUX_EVCTL_O_EVTOMCUFLAGSCLR                                 0x00000038

// Combined Event To MCU Mask
#define AUX_EVCTL_O_COMBEVTOMCUMASK                                 0x0000003C

// Event Observation Configuration
#define AUX_EVCTL_O_EVOBSCFG                                        0x00000040

// Manual
#define AUX_EVCTL_O_MANUAL                                          0x00000048

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVSTAT0
//
//*****************************************************************************
// Field:    [15] AUXIO15
//
// AUXIO15 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 7.
#define AUX_EVCTL_EVSTAT0_AUXIO15                                   0x00008000
#define AUX_EVCTL_EVSTAT0_AUXIO15_BITN                                      15
#define AUX_EVCTL_EVSTAT0_AUXIO15_M                                 0x00008000
#define AUX_EVCTL_EVSTAT0_AUXIO15_S                                         15

// Field:    [14] AUXIO14
//
// AUXIO14 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 6.
#define AUX_EVCTL_EVSTAT0_AUXIO14                                   0x00004000
#define AUX_EVCTL_EVSTAT0_AUXIO14_BITN                                      14
#define AUX_EVCTL_EVSTAT0_AUXIO14_M                                 0x00004000
#define AUX_EVCTL_EVSTAT0_AUXIO14_S                                         14

// Field:    [13] AUXIO13
//
// AUXIO13 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 5.
#define AUX_EVCTL_EVSTAT0_AUXIO13                                   0x00002000
#define AUX_EVCTL_EVSTAT0_AUXIO13_BITN                                      13
#define AUX_EVCTL_EVSTAT0_AUXIO13_M                                 0x00002000
#define AUX_EVCTL_EVSTAT0_AUXIO13_S                                         13

// Field:    [12] AUXIO12
//
// AUXIO12 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 4.
#define AUX_EVCTL_EVSTAT0_AUXIO12                                   0x00001000
#define AUX_EVCTL_EVSTAT0_AUXIO12_BITN                                      12
#define AUX_EVCTL_EVSTAT0_AUXIO12_M                                 0x00001000
#define AUX_EVCTL_EVSTAT0_AUXIO12_S                                         12

// Field:    [11] AUXIO11
//
// AUXIO11 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 3.
#define AUX_EVCTL_EVSTAT0_AUXIO11                                   0x00000800
#define AUX_EVCTL_EVSTAT0_AUXIO11_BITN                                      11
#define AUX_EVCTL_EVSTAT0_AUXIO11_M                                 0x00000800
#define AUX_EVCTL_EVSTAT0_AUXIO11_S                                         11

