espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x1_cc26x1/inc/hw_aux_evctl.h
// Field:    [12] AUXIO28
//
// AUXIO28 pin level, read value corresponds to AUX_AIODIO3:GPIODIN bit 4.
#define AUX_EVCTL_EVSTAT1_AUXIO28                                   0x00001000
#define AUX_EVCTL_EVSTAT1_AUXIO28_BITN                                      12
#define AUX_EVCTL_EVSTAT1_AUXIO28_M                                 0x00001000
#define AUX_EVCTL_EVSTAT1_AUXIO28_S                                         12

// Field:    [11] AUXIO27
//
// AUXIO27 pin level, read value corresponds to AUX_AIODIO3:GPIODIN bit 3.
#define AUX_EVCTL_EVSTAT1_AUXIO27                                   0x00000800
#define AUX_EVCTL_EVSTAT1_AUXIO27_BITN                                      11
#define AUX_EVCTL_EVSTAT1_AUXIO27_M                                 0x00000800
#define AUX_EVCTL_EVSTAT1_AUXIO27_S                                         11

// Field:    [10] AUXIO26
//
// AUXIO26 pin level, read value corresponds to AUX_AIODIO3:GPIODIN bit 2.
#define AUX_EVCTL_EVSTAT1_AUXIO26                                   0x00000400
#define AUX_EVCTL_EVSTAT1_AUXIO26_BITN                                      10
#define AUX_EVCTL_EVSTAT1_AUXIO26_M                                 0x00000400
#define AUX_EVCTL_EVSTAT1_AUXIO26_S                                         10

// Field:     [9] AUXIO25
//
// AUXIO25 pin level, read value corresponds to AUX_AIODIO3:GPIODIN bit 1.
#define AUX_EVCTL_EVSTAT1_AUXIO25                                   0x00000200
#define AUX_EVCTL_EVSTAT1_AUXIO25_BITN                                       9
#define AUX_EVCTL_EVSTAT1_AUXIO25_M                                 0x00000200
#define AUX_EVCTL_EVSTAT1_AUXIO25_S                                          9

// Field:     [8] AUXIO24
//
// AUXIO24 pin level, read value corresponds to AUX_AIODIO3:GPIODIN bit 0.
#define AUX_EVCTL_EVSTAT1_AUXIO24                                   0x00000100
#define AUX_EVCTL_EVSTAT1_AUXIO24_BITN                                       8
#define AUX_EVCTL_EVSTAT1_AUXIO24_M                                 0x00000100
#define AUX_EVCTL_EVSTAT1_AUXIO24_S                                          8

// Field:     [7] AUXIO23
//
// AUXIO23 pin level, read value corresponds to AUX_AIODIO2:GPIODIN bit 7.
#define AUX_EVCTL_EVSTAT1_AUXIO23                                   0x00000080
#define AUX_EVCTL_EVSTAT1_AUXIO23_BITN                                       7
#define AUX_EVCTL_EVSTAT1_AUXIO23_M                                 0x00000080
#define AUX_EVCTL_EVSTAT1_AUXIO23_S                                          7

// Field:     [6] AUXIO22
//
// AUXIO22 pin level, read value corresponds to AUX_AIODIO2:GPIODIN bit 6.
#define AUX_EVCTL_EVSTAT1_AUXIO22                                   0x00000040
#define AUX_EVCTL_EVSTAT1_AUXIO22_BITN                                       6
#define AUX_EVCTL_EVSTAT1_AUXIO22_M                                 0x00000040
#define AUX_EVCTL_EVSTAT1_AUXIO22_S                                          6

// Field:     [5] AUXIO21
//
// AUXIO21 pin level, read value corresponds to AUX_AIODIO2:GPIODIN bit 5.
#define AUX_EVCTL_EVSTAT1_AUXIO21                                   0x00000020
#define AUX_EVCTL_EVSTAT1_AUXIO21_BITN                                       5
#define AUX_EVCTL_EVSTAT1_AUXIO21_M                                 0x00000020
#define AUX_EVCTL_EVSTAT1_AUXIO21_S                                          5

// Field:     [4] AUXIO20
//
// AUXIO20 pin level, read value corresponds to AUX_AIODIO2:GPIODIN bit 4.
#define AUX_EVCTL_EVSTAT1_AUXIO20                                   0x00000010
#define AUX_EVCTL_EVSTAT1_AUXIO20_BITN                                       4
#define AUX_EVCTL_EVSTAT1_AUXIO20_M                                 0x00000010
#define AUX_EVCTL_EVSTAT1_AUXIO20_S                                          4

// Field:     [3] AUXIO19
//
// AUXIO19 pin level, read value corresponds to AUX_AIODIO2:GPIODIN bit 3.
#define AUX_EVCTL_EVSTAT1_AUXIO19                                   0x00000008
#define AUX_EVCTL_EVSTAT1_AUXIO19_BITN                                       3
#define AUX_EVCTL_EVSTAT1_AUXIO19_M                                 0x00000008
#define AUX_EVCTL_EVSTAT1_AUXIO19_S                                          3

// Field:     [2] AUXIO18
//
// AUXIO18 pin level, read value corresponds to AUX_AIODIO2:GPIODIN bit 2.
#define AUX_EVCTL_EVSTAT1_AUXIO18                                   0x00000004
#define AUX_EVCTL_EVSTAT1_AUXIO18_BITN                                       2
#define AUX_EVCTL_EVSTAT1_AUXIO18_M                                 0x00000004
#define AUX_EVCTL_EVSTAT1_AUXIO18_S                                          2

// Field:     [1] AUXIO17
//
// AUXIO17 pin level, read value corresponds to AUX_AIODIO2:GPIODIN bit 1.
#define AUX_EVCTL_EVSTAT1_AUXIO17                                   0x00000002
#define AUX_EVCTL_EVSTAT1_AUXIO17_BITN                                       1
#define AUX_EVCTL_EVSTAT1_AUXIO17_M                                 0x00000002
#define AUX_EVCTL_EVSTAT1_AUXIO17_S                                          1

// Field:     [0] AUXIO16
//
// AUXIO16 pin level, read value corresponds to AUX_AIODIO2:GPIODIN bit 0.
#define AUX_EVCTL_EVSTAT1_AUXIO16                                   0x00000001
#define AUX_EVCTL_EVSTAT1_AUXIO16_BITN                                       0
#define AUX_EVCTL_EVSTAT1_AUXIO16_M                                 0x00000001
#define AUX_EVCTL_EVSTAT1_AUXIO16_S                                          0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVSTAT2
//
//*****************************************************************************
// Field:    [15] AUX_COMPB
//
// Comparator B output.
// Configuration of AUX_SYSIF:EVSYNCRATE.AUX_COMPB_SYNC_RATE sets the
// synchronization rate for this event.
#define AUX_EVCTL_EVSTAT2_AUX_COMPB                                 0x00008000
#define AUX_EVCTL_EVSTAT2_AUX_COMPB_BITN                                    15
#define AUX_EVCTL_EVSTAT2_AUX_COMPB_M                               0x00008000
#define AUX_EVCTL_EVSTAT2_AUX_COMPB_S                                       15

// Field:    [14] AUX_COMPA
//
// Comparator A output.
// Configuration of AUX_SYSIF:EVSYNCRATE.AUX_COMPA_SYNC_RATE sets the
// synchronization rate for this event.
#define AUX_EVCTL_EVSTAT2_AUX_COMPA                                 0x00004000
#define AUX_EVCTL_EVSTAT2_AUX_COMPA_BITN                                    14
#define AUX_EVCTL_EVSTAT2_AUX_COMPA_M                               0x00004000
#define AUX_EVCTL_EVSTAT2_AUX_COMPA_S                                       14

