espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x1_cc26x1/inc/hw_aux_evctl.h
// Field:    [12] AUX_ADC_FIFO_NOT_EMPTY
//
// AUX_ANAIF:ADCFIFOSTAT.EMPTY negated
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_NOT_EMPTY                    0x00001000
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_NOT_EMPTY_BITN                       12
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_NOT_EMPTY_M                  0x00001000
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_NOT_EMPTY_S                          12

// Field:    [11] AUX_ADC_FIFO_ALMOST_FULL
//
// AUX_ANAIF:ADCFIFOSTAT.ALMOST_FULL
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_ALMOST_FULL                  0x00000800
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_ALMOST_FULL_BITN                     11
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_ALMOST_FULL_M                0x00000800
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_ALMOST_FULL_S                        11

// Field:    [10] AUX_ADC_IRQ
//
// The logical function for this event is configurable.
//
// When DMACTL.EN = 1 :
//    Event = UDMA0 Channel 7 done event     OR
// AUX_ANAIF:ADCFIFOSTAT.OVERFLOW      OR      AUX_ANAIF:ADCFIFOSTAT.UNDERFLOW
//
// When DMACTL.EN = 0 :
//    Event = (NOT AUX_ANAIF:ADCFIFOSTAT.EMPTY)      OR
// AUX_ANAIF:ADCFIFOSTAT.OVERFLOW      OR      AUX_ANAIF:ADCFIFOSTAT.UNDERFLOW
//
// Bit 7 in UDMA0:DONEMASK must be 0.
#define AUX_EVCTL_EVSTAT3_AUX_ADC_IRQ                               0x00000400
#define AUX_EVCTL_EVSTAT3_AUX_ADC_IRQ_BITN                                  10
#define AUX_EVCTL_EVSTAT3_AUX_ADC_IRQ_M                             0x00000400
#define AUX_EVCTL_EVSTAT3_AUX_ADC_IRQ_S                                     10

// Field:     [9] AUX_ADC_DONE
//
// AUX_ANAIF ADC conversion done event.
// Event is synchronized at AUX bus rate.
#define AUX_EVCTL_EVSTAT3_AUX_ADC_DONE                              0x00000200
#define AUX_EVCTL_EVSTAT3_AUX_ADC_DONE_BITN                                  9
#define AUX_EVCTL_EVSTAT3_AUX_ADC_DONE_M                            0x00000200
#define AUX_EVCTL_EVSTAT3_AUX_ADC_DONE_S                                     9

// Field:     [8] AUX_ISRC_RESET_N
//
// AUX_ANAIF:ISRCCTL.RESET_N
#define AUX_EVCTL_EVSTAT3_AUX_ISRC_RESET_N                          0x00000100
#define AUX_EVCTL_EVSTAT3_AUX_ISRC_RESET_N_BITN                              8
#define AUX_EVCTL_EVSTAT3_AUX_ISRC_RESET_N_M                        0x00000100
#define AUX_EVCTL_EVSTAT3_AUX_ISRC_RESET_N_S                                 8

// Field:     [7] AUX_TDC_DONE
//
// AUX_TDC:STAT.DONE
#define AUX_EVCTL_EVSTAT3_AUX_TDC_DONE                              0x00000080
#define AUX_EVCTL_EVSTAT3_AUX_TDC_DONE_BITN                                  7
#define AUX_EVCTL_EVSTAT3_AUX_TDC_DONE_M                            0x00000080
#define AUX_EVCTL_EVSTAT3_AUX_TDC_DONE_S                                     7

// Field:     [6] AUX_TIMER0_EV
//
// AUX_TIMER0_EV event, see AUX_TIMER01:T0TARGET for description.
#define AUX_EVCTL_EVSTAT3_AUX_TIMER0_EV                             0x00000040
#define AUX_EVCTL_EVSTAT3_AUX_TIMER0_EV_BITN                                 6
#define AUX_EVCTL_EVSTAT3_AUX_TIMER0_EV_M                           0x00000040
#define AUX_EVCTL_EVSTAT3_AUX_TIMER0_EV_S                                    6

// Field:     [5] AUX_TIMER1_EV
//
// AUX_TIMER1_EV event, see AUX_TIMER01:T1TARGET for description.
#define AUX_EVCTL_EVSTAT3_AUX_TIMER1_EV                             0x00000020
#define AUX_EVCTL_EVSTAT3_AUX_TIMER1_EV_BITN                                 5
#define AUX_EVCTL_EVSTAT3_AUX_TIMER1_EV_M                           0x00000020
#define AUX_EVCTL_EVSTAT3_AUX_TIMER1_EV_S                                    5

//*****************************************************************************
//
// Register: AUX_EVCTL_O_DMACTL
//
//*****************************************************************************
// Field:     [2] REQ_MODE
//
// UDMA0 Request mode
// ENUMs:
// SINGLE                   Single requests are generated on UDMA0 channel 7
//                          when the condition configured in SEL is met.
// BURST                    Burst requests are generated on UDMA0 channel 7
//                          when the condition configured in SEL is met.
#define AUX_EVCTL_DMACTL_REQ_MODE                                   0x00000004
#define AUX_EVCTL_DMACTL_REQ_MODE_BITN                                       2
#define AUX_EVCTL_DMACTL_REQ_MODE_M                                 0x00000004
#define AUX_EVCTL_DMACTL_REQ_MODE_S                                          2
#define AUX_EVCTL_DMACTL_REQ_MODE_SINGLE                            0x00000004
#define AUX_EVCTL_DMACTL_REQ_MODE_BURST                             0x00000000

// Field:     [1] EN
//
// uDMA ADC interface enable.
//
// 0: Disable UDMA0 interface to ADC.
// 1: Enable UDMA0 interface to ADC.
#define AUX_EVCTL_DMACTL_EN                                         0x00000002
#define AUX_EVCTL_DMACTL_EN_BITN                                             1
#define AUX_EVCTL_DMACTL_EN_M                                       0x00000002
#define AUX_EVCTL_DMACTL_EN_S                                                1

// Field:     [0] SEL
//
// Select FIFO watermark level required to trigger a UDMA0 transfer of ADC FIFO
// data.
// ENUMs:
// AUX_ADC_FIFO_ALMOST_FULL UDMA0 trigger event will be generated when the ADC
//                          FIFO is almost full (3/4 full).
// AUX_ADC_FIFO_NOT_EMPTY   UDMA0 trigger event will be generated when there
//                          are samples in the ADC FIFO.
#define AUX_EVCTL_DMACTL_SEL                                        0x00000001
#define AUX_EVCTL_DMACTL_SEL_BITN                                            0
#define AUX_EVCTL_DMACTL_SEL_M                                      0x00000001
#define AUX_EVCTL_DMACTL_SEL_S                                               0
#define AUX_EVCTL_DMACTL_SEL_AUX_ADC_FIFO_ALMOST_FULL               0x00000001
#define AUX_EVCTL_DMACTL_SEL_AUX_ADC_FIFO_NOT_EMPTY                 0x00000000

//*****************************************************************************
//
// Register: AUX_EVCTL_O_SWEVSET
//
//*****************************************************************************
// Field:     [2] SWEV2
//
// Software event flag 2.
//
// 0: No effect.
// 1: Set software event flag 2.
#define AUX_EVCTL_SWEVSET_SWEV2                                     0x00000004
#define AUX_EVCTL_SWEVSET_SWEV2_BITN                                         2
#define AUX_EVCTL_SWEVSET_SWEV2_M                                   0x00000004
#define AUX_EVCTL_SWEVSET_SWEV2_S                                            2

// Field:     [1] SWEV1
//
// Software event flag 1.
//
// 0: No effect.
// 1: Set software event flag 1.
#define AUX_EVCTL_SWEVSET_SWEV1                                     0x00000002
#define AUX_EVCTL_SWEVSET_SWEV1_BITN                                         1
#define AUX_EVCTL_SWEVSET_SWEV1_M                                   0x00000002
#define AUX_EVCTL_SWEVSET_SWEV1_S                                            1

// Field:     [0] SWEV0
//
// Software event flag 0.
//
// 0: No effect.
// 1: Set software event flag 0.
#define AUX_EVCTL_SWEVSET_SWEV0                                     0x00000001
#define AUX_EVCTL_SWEVSET_SWEV0_BITN                                         0
#define AUX_EVCTL_SWEVSET_SWEV0_M                                   0x00000001
#define AUX_EVCTL_SWEVSET_SWEV0_S                                            0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOAONFLAGS
//
//*****************************************************************************
// Field:     [8] AUX_TIMER1_EV
//
// This event flag is set when level selected by EVTOAONPOL.AUX_TIMER1_EV
// occurs on EVSTAT3.AUX_TIMER1_EV.
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TIMER1_EV                        0x00000100
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TIMER1_EV_BITN                            8
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TIMER1_EV_M                      0x00000100
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TIMER1_EV_S                               8

// Field:     [7] AUX_TIMER0_EV
//
// This event flag is set when level selected by EVTOAONPOL.AUX_TIMER0_EV
// occurs on EVSTAT3.AUX_TIMER0_EV.
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TIMER0_EV                        0x00000080
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TIMER0_EV_BITN                            7
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TIMER0_EV_M                      0x00000080
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TIMER0_EV_S                               7

// Field:     [6] AUX_TDC_DONE
//
// This event flag is set when level selected by EVTOAONPOL.AUX_TDC_DONE occurs
// on EVSTAT3.AUX_TDC_DONE.
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TDC_DONE                         0x00000040
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TDC_DONE_BITN                             6
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TDC_DONE_M                       0x00000040
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TDC_DONE_S                                6

// Field:     [5] AUX_ADC_DONE
//
// This event flag is set when level selected by EVTOAONPOL.AUX_ADC_DONE occurs
// on EVSTAT3.AUX_ADC_DONE.
#define AUX_EVCTL_EVTOAONFLAGS_AUX_ADC_DONE                         0x00000020
#define AUX_EVCTL_EVTOAONFLAGS_AUX_ADC_DONE_BITN                             5
#define AUX_EVCTL_EVTOAONFLAGS_AUX_ADC_DONE_M                       0x00000020
#define AUX_EVCTL_EVTOAONFLAGS_AUX_ADC_DONE_S                                5

// Field:     [4] AUX_COMPB
//
// This event flag is set when edge selected by EVTOAONPOL.AUX_COMPB occurs on
// EVSTAT2.AUX_COMPB.
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPB                            0x00000010
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPB_BITN                                4
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPB_M                          0x00000010
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPB_S                                   4

