espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x1_cc26x1/inc/hw_aux_evctl.h
// Field:     [3] AUX_COMPA
//
// Write 1 to clear EVTOAONFLAGS.AUX_COMPA.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPA                         0x00000008
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPA_BITN                             3
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPA_M                       0x00000008
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPA_S                                3

// Field:     [2] SWEV2
//
// Write 1 to clear EVTOAONFLAGS.SWEV2.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV2                             0x00000004
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV2_BITN                                 2
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV2_M                           0x00000004
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV2_S                                    2

// Field:     [1] SWEV1
//
// Write 1 to clear EVTOAONFLAGS.SWEV1.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV1                             0x00000002
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV1_BITN                                 1
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV1_M                           0x00000002
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV1_S                                    1

// Field:     [0] SWEV0
//
// Write 1 to clear EVTOAONFLAGS.SWEV0.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV0                             0x00000001
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV0_BITN                                 0
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV0_M                           0x00000001
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV0_S                                    0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOMCUFLAGS
//
//*****************************************************************************
// Field:    [10] AUX_ADC_IRQ
//
// This event flag is set when level selected by EVTOMCUPOL.AUX_ADC_IRQ occurs
// on EVSTAT3.AUX_ADC_IRQ.
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_ADC_IRQ                          0x00000400
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_ADC_IRQ_BITN                             10
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_ADC_IRQ_M                        0x00000400
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_ADC_IRQ_S                                10

// Field:     [9] MCU_OBSMUX0
//
// This event flag is set when level selected by EVTOMCUPOL.MCU_OBSMUX0 occurs
// on EVSTAT2.MCU_OBSMUX0.
#define AUX_EVCTL_EVTOMCUFLAGS_MCU_OBSMUX0                          0x00000200
#define AUX_EVCTL_EVTOMCUFLAGS_MCU_OBSMUX0_BITN                              9
#define AUX_EVCTL_EVTOMCUFLAGS_MCU_OBSMUX0_M                        0x00000200
#define AUX_EVCTL_EVTOMCUFLAGS_MCU_OBSMUX0_S                                 9

// Field:     [8] AUX_ADC_FIFO_ALMOST_FULL
//
// This event flag is set when level selected by
// EVTOMCUPOL.AUX_ADC_FIFO_ALMOST_FULL occurs on
// EVSTAT3.AUX_ADC_FIFO_ALMOST_FULL.
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_ADC_FIFO_ALMOST_FULL             0x00000100
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_ADC_FIFO_ALMOST_FULL_BITN                 8
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_ADC_FIFO_ALMOST_FULL_M           0x00000100
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_ADC_FIFO_ALMOST_FULL_S                    8

// Field:     [7] AUX_ADC_DONE
//
// This event flag is set when level selected by EVTOMCUPOL.AUX_ADC_DONE occurs
// on EVSTAT3.AUX_ADC_DONE.
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_ADC_DONE                         0x00000080
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_ADC_DONE_BITN                             7
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_ADC_DONE_M                       0x00000080
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_ADC_DONE_S                                7

// Field:     [6] AUX_SMPH_AUTOTAKE_DONE
//
// This event flag is set when level selected by
// EVTOMCUPOL.AUX_SMPH_AUTOTAKE_DONE occurs on EVSTAT3.AUX_SMPH_AUTOTAKE_DONE.
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_SMPH_AUTOTAKE_DONE               0x00000040
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_SMPH_AUTOTAKE_DONE_BITN                   6
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_SMPH_AUTOTAKE_DONE_M             0x00000040
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_SMPH_AUTOTAKE_DONE_S                      6

// Field:     [5] AUX_TIMER1_EV
//
// This event flag is set when level selected by EVTOMCUPOL.AUX_TIMER1_EV
// occurs on EVSTAT3.AUX_TIMER1_EV.
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER1_EV                        0x00000020
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER1_EV_BITN                            5
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER1_EV_M                      0x00000020
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER1_EV_S                               5

// Field:     [4] AUX_TIMER0_EV
//
// This event flag is set when level selected by EVTOMCUPOL.AUX_TIMER0_EV
// occurs on EVSTAT3.AUX_TIMER0_EV.
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER0_EV                        0x00000010
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER0_EV_BITN                            4
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER0_EV_M                      0x00000010
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER0_EV_S                               4

// Field:     [3] AUX_TDC_DONE
//
// This event flag is set when level selected by EVTOMCUPOL.AUX_TDC_DONE occurs
// on EVSTAT3.AUX_TDC_DONE.
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TDC_DONE                         0x00000008
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TDC_DONE_BITN                             3
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TDC_DONE_M                       0x00000008
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TDC_DONE_S                                3

// Field:     [2] AUX_COMPB
//
// This event flag is set when edge selected by EVTOMCUPOL.AUX_COMPB occurs on
// EVSTAT2.AUX_COMPB.
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_COMPB                            0x00000004
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_COMPB_BITN                                2
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_COMPB_M                          0x00000004
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_COMPB_S                                   2

// Field:     [1] AUX_COMPA
//
// This event flag is set when edge selected by EVTOMCUPOL.AUX_COMPA occurs on
// EVSTAT2.AUX_COMPA.
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_COMPA                            0x00000002
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_COMPA_BITN                                1
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_COMPA_M                          0x00000002
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_COMPA_S                                   1

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOMCUPOL
//
//*****************************************************************************
// Field:    [10] AUX_ADC_IRQ
//
// Select the event source level that sets EVTOMCUFLAGS.AUX_ADC_IRQ.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_IRQ                            0x00000400
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_IRQ_BITN                               10
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_IRQ_M                          0x00000400
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_IRQ_S                                  10
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_IRQ_LOW                        0x00000400
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_IRQ_HIGH                       0x00000000

