espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x1_cc26x1/inc/hw_aux_evctl.h
// Field:     [9] MCU_OBSMUX0
//
// Select the event source level that sets EVTOMCUFLAGS.MCU_OBSMUX0.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_MCU_OBSMUX0                            0x00000200
#define AUX_EVCTL_EVTOMCUPOL_MCU_OBSMUX0_BITN                                9
#define AUX_EVCTL_EVTOMCUPOL_MCU_OBSMUX0_M                          0x00000200
#define AUX_EVCTL_EVTOMCUPOL_MCU_OBSMUX0_S                                   9
#define AUX_EVCTL_EVTOMCUPOL_MCU_OBSMUX0_LOW                        0x00000200
#define AUX_EVCTL_EVTOMCUPOL_MCU_OBSMUX0_HIGH                       0x00000000

// Field:     [8] AUX_ADC_FIFO_ALMOST_FULL
//
// Select the event source level that sets
// EVTOMCUFLAGS.AUX_ADC_FIFO_ALMOST_FULL.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_FIFO_ALMOST_FULL               0x00000100
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_FIFO_ALMOST_FULL_BITN                   8
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_FIFO_ALMOST_FULL_M             0x00000100
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_FIFO_ALMOST_FULL_S                      8
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_FIFO_ALMOST_FULL_LOW           0x00000100
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_FIFO_ALMOST_FULL_HIGH          0x00000000

// Field:     [7] AUX_ADC_DONE
//
// Select the event source level that sets EVTOMCUFLAGS.AUX_ADC_DONE.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_DONE                           0x00000080
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_DONE_BITN                               7
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_DONE_M                         0x00000080
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_DONE_S                                  7
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_DONE_LOW                       0x00000080
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_DONE_HIGH                      0x00000000

// Field:     [6] AUX_SMPH_AUTOTAKE_DONE
//
// Select the event source level that sets EVTOMCUFLAGS.AUX_SMPH_AUTOTAKE_DONE.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_SMPH_AUTOTAKE_DONE                 0x00000040
#define AUX_EVCTL_EVTOMCUPOL_AUX_SMPH_AUTOTAKE_DONE_BITN                     6
#define AUX_EVCTL_EVTOMCUPOL_AUX_SMPH_AUTOTAKE_DONE_M               0x00000040
#define AUX_EVCTL_EVTOMCUPOL_AUX_SMPH_AUTOTAKE_DONE_S                        6
#define AUX_EVCTL_EVTOMCUPOL_AUX_SMPH_AUTOTAKE_DONE_LOW             0x00000040
#define AUX_EVCTL_EVTOMCUPOL_AUX_SMPH_AUTOTAKE_DONE_HIGH            0x00000000

// Field:     [5] AUX_TIMER1_EV
//
// Select the event source level that sets EVTOMCUFLAGS.AUX_TIMER1_EV.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER1_EV                          0x00000020
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER1_EV_BITN                              5
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER1_EV_M                        0x00000020
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER1_EV_S                                 5
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER1_EV_LOW                      0x00000020
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER1_EV_HIGH                     0x00000000

// Field:     [4] AUX_TIMER0_EV
//
// Select the event source level that sets EVTOMCUFLAGS.AUX_TIMER0_EV.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER0_EV                          0x00000010
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER0_EV_BITN                              4
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER0_EV_M                        0x00000010
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER0_EV_S                                 4
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER0_EV_LOW                      0x00000010
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER0_EV_HIGH                     0x00000000

// Field:     [3] AUX_TDC_DONE
//
// Select the event source level that sets EVTOMCUFLAGS.AUX_TDC_DONE.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_TDC_DONE                           0x00000008
#define AUX_EVCTL_EVTOMCUPOL_AUX_TDC_DONE_BITN                               3
#define AUX_EVCTL_EVTOMCUPOL_AUX_TDC_DONE_M                         0x00000008
#define AUX_EVCTL_EVTOMCUPOL_AUX_TDC_DONE_S                                  3
#define AUX_EVCTL_EVTOMCUPOL_AUX_TDC_DONE_LOW                       0x00000008
#define AUX_EVCTL_EVTOMCUPOL_AUX_TDC_DONE_HIGH                      0x00000000

// Field:     [2] AUX_COMPB
//
// Select the event source edge that sets EVTOMCUFLAGS.AUX_COMPB.
// ENUMs:
// FALL                     Falling edge
// RISE                     Rising edge
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPB                              0x00000004
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPB_BITN                                  2
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPB_M                            0x00000004
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPB_S                                     2
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPB_FALL                         0x00000004
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPB_RISE                         0x00000000

// Field:     [1] AUX_COMPA
//
// Select the event source edge that sets EVTOMCUFLAGS.AUX_COMPA.
// ENUMs:
// FALL                     Falling edge
// RISE                     Rising edge
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPA                              0x00000002
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPA_BITN                                  1
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPA_M                            0x00000002
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPA_S                                     1
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPA_FALL                         0x00000002
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPA_RISE                         0x00000000

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOMCUFLAGSCLR
//
//*****************************************************************************
// Field:    [10] AUX_ADC_IRQ
//
// Write 1 to clear EVTOMCUFLAGS.AUX_ADC_IRQ.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_ADC_IRQ                       0x00000400
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_ADC_IRQ_BITN                          10
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_ADC_IRQ_M                     0x00000400
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_ADC_IRQ_S                             10

