espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x1_cc26x1/inc/hw_aux_evctl.h
// Field:     [5] AUX_TIMER1_EV
//
// EVTOMCUFLAGS.AUX_TIMER1_EV contribution to the AUX_COMB event.
//
// 0: Exclude.
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER1_EV                     0x00000020
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER1_EV_BITN                         5
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER1_EV_M                   0x00000020
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER1_EV_S                            5

// Field:     [4] AUX_TIMER0_EV
//
// EVTOMCUFLAGS.AUX_TIMER0_EV contribution to the AUX_COMB event.
//
// 0: Exclude.
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER0_EV                     0x00000010
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER0_EV_BITN                         4
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER0_EV_M                   0x00000010
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER0_EV_S                            4

// Field:     [3] AUX_TDC_DONE
//
// EVTOMCUFLAGS.AUX_TDC_DONE contribution to the AUX_COMB event.
//
// 0: Exclude.
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TDC_DONE                      0x00000008
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TDC_DONE_BITN                          3
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TDC_DONE_M                    0x00000008
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TDC_DONE_S                             3

// Field:     [2] AUX_COMPB
//
// EVTOMCUFLAGS.AUX_COMPB contribution to the AUX_COMB event.
//
// 0: Exclude
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_COMPB                         0x00000004
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_COMPB_BITN                             2
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_COMPB_M                       0x00000004
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_COMPB_S                                2

// Field:     [1] AUX_COMPA
//
// EVTOMCUFLAGS.AUX_COMPA contribution to the AUX_COMB event.
//
// 0: Exclude.
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_COMPA                         0x00000002
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_COMPA_BITN                             1
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_COMPA_M                       0x00000002
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_COMPA_S                                1

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVOBSCFG
//
//*****************************************************************************
// Field:   [5:0] EVOBS_SEL
//
// Select which event from the asynchronous event bus that represents
// AUX_EV_OBS in AUX_AIODIOn.
// ENUMs:
// AUX_DAC_HOLD_ACTIVE      EVSTAT3.AUX_DAC_HOLD_ACTIVE
// AUX_SMPH_AUTOTAKE_DONE   EVSTAT3.AUX_SMPH_AUTOTAKE_DONE
// AUX_ADC_FIFO_NOT_EMPTY   EVSTAT3.AUX_ADC_FIFO_NOT_EMPTY
// AUX_ADC_FIFO_ALMOST_FULL EVSTAT3.AUX_ADC_FIFO_ALMOST_FULL
// AUX_ADC_IRQ              EVSTAT3.AUX_ADC_IRQ
// AUX_ADC_DONE             EVSTAT3.AUX_ADC_DONE
// AUX_ISRC_RESET_N         EVSTAT3.AUX_ISRC_RESET_N
// AUX_TDC_DONE             EVSTAT3.AUX_TDC_DONE
// AUX_TIMER0_EV            EVSTAT3.AUX_TIMER0_EV
// AUX_TIMER1_EV            EVSTAT3.AUX_TIMER1_EV
// AUX_COMPB                EVSTAT2.AUX_COMPB
// AUX_COMPA                EVSTAT2.AUX_COMPA
// MCU_OBSMUX1              EVSTAT2.MCU_OBSMUX1
// MCU_OBSMUX0              EVSTAT2.MCU_OBSMUX0
// MCU_EV                   EVSTAT2.MCU_EV
// ACLK_REF                 EVSTAT2.ACLK_REF
// VDDR_RECHARGE            EVSTAT2.VDDR_RECHARGE
// MCU_ACTIVE               EVSTAT2.MCU_ACTIVE
// PWR_DWN                  EVSTAT2.PWR_DWN
// SCLK_LF                  EVSTAT2.SCLK_LF
// AON_RTC_4KHZ             EVSTAT2.AON_RTC_4KHZ
// AON_RTC_CH2_DLY          EVSTAT2.AON_RTC_CH2_DLY
// AON_RTC_CH2              EVSTAT2.AON_RTC_CH2
// MANUAL_EV                EVSTAT2.MANUAL_EV
// AUXIO31                  EVSTAT1.AUXIO31
// AUXIO30                  EVSTAT1.AUXIO30
// AUXIO29                  EVSTAT1.AUXIO29
// AUXIO28                  EVSTAT1.AUXIO28
// AUXIO27                  EVSTAT1.AUXIO27
// AUXIO26                  EVSTAT1.AUXIO26
// AUXIO25                  EVSTAT1.AUXIO25
// AUXIO24                  EVSTAT1.AUXIO24
// AUXIO23                  EVSTAT1.AUXIO23
// AUXIO22                  EVSTAT1.AUXIO22
// AUXIO21                  EVSTAT1.AUXIO21
// AUXIO20                  EVSTAT1.AUXIO20
// AUXIO19                  EVSTAT1.AUXIO19
// AUXIO18                  EVSTAT1.AUXIO18
// AUXIO17                  EVSTAT1.AUXIO17
// AUXIO16                  EVSTAT1.AUXIO16
// AUXIO15                  EVSTAT0.AUXIO15
// AUXIO14                  EVSTAT0.AUXIO14
// AUXIO13                  EVSTAT0.AUXIO13
// AUXIO12                  EVSTAT0.AUXIO12
// AUXIO11                  EVSTAT0.AUXIO11
// AUXIO10                  EVSTAT0.AUXIO10
// AUXIO9                   EVSTAT0.AUXIO9
// AUXIO8                   EVSTAT0.AUXIO8
// AUXIO7                   EVSTAT0.AUXIO7
// AUXIO6                   EVSTAT0.AUXIO6
// AUXIO5                   EVSTAT0.AUXIO5
// AUXIO4                   EVSTAT0.AUXIO4
// AUXIO3                   EVSTAT0.AUXIO3
// AUXIO2                   EVSTAT0.AUXIO2
// AUXIO1                   EVSTAT0.AUXIO1
// AUXIO0                   EVSTAT0.AUXIO0
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_W                                       6
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_M                              0x0000003F
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_S                                       0
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUX_DAC_HOLD_ACTIVE            0x0000003E
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUX_SMPH_AUTOTAKE_DONE         0x0000003D
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUX_ADC_FIFO_NOT_EMPTY         0x0000003C
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUX_ADC_FIFO_ALMOST_FULL       0x0000003B
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUX_ADC_IRQ                    0x0000003A
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUX_ADC_DONE                   0x00000039
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUX_ISRC_RESET_N               0x00000038
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUX_TDC_DONE                   0x00000037
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUX_TIMER0_EV                  0x00000036
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUX_TIMER1_EV                  0x00000035
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUX_COMPB                      0x0000002F
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUX_COMPA                      0x0000002E
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_MCU_OBSMUX1                    0x0000002D
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_MCU_OBSMUX0                    0x0000002C
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_MCU_EV                         0x0000002B
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_ACLK_REF                       0x0000002A
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_VDDR_RECHARGE                  0x00000029
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_MCU_ACTIVE                     0x00000028
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_PWR_DWN                        0x00000027
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_SCLK_LF                        0x00000026
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AON_RTC_4KHZ                   0x00000023
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AON_RTC_CH2_DLY                0x00000022
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AON_RTC_CH2                    0x00000021
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_MANUAL_EV                      0x00000020
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO31                        0x0000001F
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO30                        0x0000001E
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO29                        0x0000001D
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO28                        0x0000001C
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO27                        0x0000001B
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO26                        0x0000001A
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO25                        0x00000019
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO24                        0x00000018
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO23                        0x00000017
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO22                        0x00000016
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO21                        0x00000015
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO20                        0x00000014
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO19                        0x00000013
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO18                        0x00000012
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO17                        0x00000011
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO16                        0x00000010
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO15                        0x0000000F
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO14                        0x0000000E
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO13                        0x0000000D
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO12                        0x0000000C
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO11                        0x0000000B
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO10                        0x0000000A
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO9                         0x00000009
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO8                         0x00000008
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO7                         0x00000007
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO6                         0x00000006
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO5                         0x00000005
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO4                         0x00000004
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO3                         0x00000003
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO2                         0x00000002
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO1                         0x00000001
#define AUX_EVCTL_EVOBSCFG_EVOBS_SEL_AUXIO0                         0x00000000

//*****************************************************************************
//
// Register: AUX_EVCTL_O_MANUAL
//
//*****************************************************************************
// Field:     [0] EV
//
// This bit field sets the value of EVSTAT2.MANUAL_EV.
#define AUX_EVCTL_MANUAL_EV                                         0x00000001
#define AUX_EVCTL_MANUAL_EV_BITN                                             0
#define AUX_EVCTL_MANUAL_EV_M                                       0x00000001
#define AUX_EVCTL_MANUAL_EV_S                                                0


#endif // __AUX_EVCTL__
